fun main() {
/**TODO
В методе main выполните следующие действия:
- Объявите переменную с именем "age" типа Int и присвойте ей значение вашего возраста.
- Объявите переменную с именем "name" типа String и присвойте ей значение вашего имени.
- Объявите переменную с именем "isStudent" типа Boolean и присвойте ей значение true, если вы студент, и false в противном случае.
- Объявите переменную с именем "salary" типа Double и присвойте ей значение вашего месячного дохода (можете выбрать любую сумму).
- Выведите на экран значения всех объявленных переменных, разделяя их, например, символом " | ".
 */

    val age: Int = 50
    val name: String = "Михаил"
    val isStudent: Boolean = true
    val salary: Double = 2_500.0

    println("Age: $age | Name: $name | IsStudent: $isStudent | Salary: $salary")
}